testing/case_0p8/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
7.43495e-06
5.78547e-06
6.68466e-06
7.8876e-06
4.23195e-06
5.02042e-06
6.62007e-06
5.59271e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
7.43495e-06
6.68466e-06
5.59271e-06
4.63787e-06
3.80341e-06
3.16932e-06
2.59852e-06
2.05333e-06
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            epsilonWallFunction;
        value           nonuniform List<scalar> 
139
(
2.17181e-06
2.18345e-06
2.19395e-06
2.19888e-06
2.19247e-06
2.17132e-06
2.14567e-06
2.11391e-06
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
