testing/case_0p8/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "20000";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
10981
(
6.69092e-06
3.25416e-05
6.0143e-06
7.0981e-06
4.00654e-05
2.98679e-05
3.48149e-05
4.93266e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        value           nonuniform List<scalar> 
139
(
1.79019e-07
1.45323e-07
9.67239e-08
5.28519e-08
2.256e-08
1.04353e-08
5.50387e-09
3.11371e-09
...
)
;
    }
    defaultFaces
    {
        type            empty;
    }
    topWall
    {
        type            kLowReWallFunction;
        Ceps2           1.9;
        value           nonuniform List<scalar> 
139
(
1.59744e-08
1.62231e-08
1.67011e-08
1.75252e-08
1.88177e-08
2.03925e-08
2.22745e-08
2.43528e-08
...
)
;
    }
    outlet
    {
        type            cyclic;
    }
    inlet
    {
        type            cyclic;
    }
}


// ************************************************************************* //
